# UN Data Analysis

Analysis on UN Data comparing gdp per capita and internet usage

#### Import Library

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

####  Formatting

In [2]:
%matplotlib inline

#### Using the pandas read_csv() function, read the GDP dataset into your notebook as a DataFrame called gdp_df. Take a look at the first 6 rows.

In [17]:
gdp_df = pd.read_csv('../data/gdp_percapita.csv')
gdp_df.head(6)

  Country or Area  Year        Value  Value Footnotes
0     Afghanistan  2018  1734.723214              NaN
1     Afghanistan  2017  1758.465636              NaN
2     Afghanistan  2016  1757.023490              NaN
3     Afghanistan  2015  1766.593077              NaN
4     Afghanistan  2014  1795.735834              NaN
5     Afghanistan  2013  1807.762344              NaN

#### internet_df and the first six rows.

In [18]:
internet_df = pd.read_csv('../data/internet_use.csv',  nrows=4495)
internet_df.head(6)

  Country or Area  Year     Value  Value Footnotes
0     Afghanistan  2014  6.390000              NaN
1     Afghanistan  2013  5.900000              NaN
2     Afghanistan  2012  5.454545              NaN
3     Afghanistan  2011  5.000000              NaN
4     Afghanistan  2010  4.000000              NaN
5     Afghanistan  2009  3.550000              NaN

#### Examine shapes of dataframes. Numbers of columns and rows

In [5]:
gdp_df.shape ## 6731 rows and 4 columns

(6731, 4)

In [6]:
internet_df.shape ## 4675 rows and 4 columns

(4495, 4)

#### Examine data types for the columns in each table

In [20]:
gdp_df.dtypes

Country or Area     object
Year                object
Value              float64
Value Footnotes    float64
dtype: object

In [8]:
internet_df.dtypes

Country or Area     object
Year                 int64
Value              float64
Value Footnotes    float64
dtype: object

#### Examine last 10 rows of each table

In [25]:
gdp_df.tail(10)

     Country or Area                                      Year        Value
6721        Zimbabwe                                      1997  3036.422224
6722        Zimbabwe                                      1996  2985.856605
6723        Zimbabwe                                      1995  2736.486436
6724        Zimbabwe                                      1994  2768.309953
6725        Zimbabwe                                      1993  2572.870395
6726        Zimbabwe                                      1992  2591.007534
6727        Zimbabwe                                      1991  2906.272849
6728        Zimbabwe                                      1990  2819.549467
6729   footnoteSeqID                                  Footnote          NaN
6730               2  Excludes South Sudan after July 9, 2011.          NaN

In [26]:
internet_df.tail(10)

     Country or Area  Year     Value
4485        Zimbabwe  2002  3.994356
4486        Zimbabwe  2001  0.799846
4487        Zimbabwe  2000  0.401434
4488        Zimbabwe  1999  0.161676
4489        Zimbabwe  1998  0.081648
4490        Zimbabwe  1997  0.033080
4491        Zimbabwe  1996  0.016790
4492        Zimbabwe  1995  0.007684
4493        Zimbabwe  1994  0.001739
4494        Zimbabwe  1990  0.000000

#### Drop the 'value footnotes' data (column) from both datasets

In [21]:
gdp_df = gdp_df.drop(columns = ['Value Footnotes'])

In [24]:
gdp_df.columns

Index(['Country or Area', 'Year', 'Value'], dtype='object')

In [22]:
internet_df = internet_df.drop(columns = ['Value Footnotes'])

In [23]:
internet_df.columns

Index(['Country or Area', 'Year', 'Value'], dtype='object')

#### Change the columns for the GDP Per Capita data frame to ‘Country’, ‘Year’, and ‘GDP_Per_Capita’

In [27]:
gdp_df.columns = ['Country','Year','GDP_Per_Capita']

In [28]:
gdp_df.columns

Index(['Country', 'Year', 'GDP_Per_Capita'], dtype='object')

#### Change the columns for the Internet Users data frame to ‘Country’, ‘Year’, and ‘Internet_Users_Pct’

In [29]:
internet_df.columns = ['Country','Year','Internet_Users_Pct']

In [30]:
internet_df.columns

Index(['Country', 'Year', 'Internet_Users_Pct'], dtype='object')

#### Merge the two DataFrames to one. Merge all rows from each of the two DataFrames. Call the new DataFrame gdp_and_internet_use

In [31]:
##result = pd.concat([gdp_df, internet_df, axis=1, join='inner')

In [34]:
result = pd.merge(gdp_df, internet_df, how='inner')

ValueError: You are trying to merge on object and int64 columns. If you wish to proceed you should use pd.concat